% -------------------------------------------------------------------------
%                        《六位置法 IMU 标定》                      
% 给 IMU 标定数据，用六位置法标定陀螺仪、加速度计的零偏、比例、交轴耦合等；
% 
% - 加速度计的六位置法可以标定出加速度计的零偏、比例因子、交轴耦合；
% - 陀螺的静态六位置法可以标定陀螺的零偏，速率法可以标定比例因子和交轴耦合；
% 
% - 静态法：加速度计的三个轴线分别垂直指上、指下并静止一段时间；
% - 速率法：绕陀螺仪的三个轴线分别正转和反转过一定的已知角度；
% 
% - 标定的目的是求出陀螺仪和加速度计的误差矩阵 Mg、Ma，和零偏向量 Bg、Ba；
% - 标定结果可以对 IMU 量测值做补偿：量测值先减零偏，再左乘误差矩阵的逆；
% 
% - 惯性级陀螺标定要求：
%     - 比例的相对误差：     10-5
%     - 安装矩阵的绝对误差： 10-5
%     - 零偏的绝对误差：     10-2
%
% - 惯性级加速度计标定要求：
%     - 比例的相对误差：     5×10-5
%     - 安装矩阵的绝对误差： 5×10-5
%     - 零偏的绝对误差：     5×10-5
% -------------------------------------------------------------------------
% - 文件中共七列数据依次为：【t(1)|gyr(3)|acc(3)】，增量形式；
% 
% - 需要通过波形来判断需要截取的数据段，再通过标定计算方法进行计算；
% 
% - 数据采集时间约半小时，动作依次为：
%       | ---- 动作描述 ----- | 时间范围 (s) | 激励向量 |
%       1. Z轴朝下静止5min    【0 - 360】      (0,0,-g)
%       -  Z轴负向旋转90度    【435 - 446】    (0,0,-10)
%       +  Z轴正向旋转90度    【469 - 480】    (0,0,10)
%       2. Z轴朝上静止5min    【522 - 911】    (0,0,g)
%       3. X轴朝上静止5min    【940 - 1200】   (g,0,0)
%       +  X轴正向旋转90度    【1161 - 1171】  (10,0,0)
%       -  X轴负向旋转90度    【1194 - 1205】  (-10,0,0)
%       4. X轴朝下静止5min    【1125 - 1169】  (-g,0,0)
%       5. Y轴朝下静止5min    【1488 - 1862】  (0,-g,0)
%       -  Y轴负向旋转90度    【1792 - 1802】  (0,-10,0)
%       +  Y轴正向旋转90度    【1843 - 1853】  (0,10,0)
%       6. Y轴朝上静止5min    【1888 - 2116】  (0,g,0)
% -------------------------------------------------------------------------
% 我理解的操作步骤：
%       1. 绘制原始数据，观察；
%       2. 用六段静止数据取平均，标定加速度计；
%       3. 用三轴正负向数据的差值，标定陀螺仪误差矩阵；
%       4. 用双位置法，标定陀螺仪零偏向量；
% -------------------------------------------------------------------------
% 参考资料：
%   1. i2nav 组合导航教程：https://www.bilibili.com/video/BV1na411Z7rQ?p=9
%   2. 《惯性仪器测试与数据分析》严恭敏，P231
% -------------------------------------------------------------------------
% 作者|创建日期|修改日期：     李郑骁 | 6/6/2024 | 6/9/2024
% -------------------------------------------------------------------------

%% ------------------------- 程序初始化 ------------------------- %%
clear; close all; clc; warning off;                    % 清空工作区、命令窗
addpath('data'); addpath('utils'); addpath('base');    % 添加数据文件目录

%% -------------------------- 配置选项 -------------------------- %%
g                           = 9.7936174;    % 当地参考重力
rw                          = 10 / 180 * pi;% 旋转角速率
hz                          = 200;          % 采样频率
ts                          = 0.005;        % 采样间隔

is_time_stamp_zero          = true;         % 是否将时间戳调整到从零开始
is_plot_raw_measurement     = true;         % 是否绘制原始 IMU 量测

%% ------------------------ 导入数据文件 ------------------------ %%
raw_imu = load('Calibration_Data.txt');                                     % 【t(1)|gyr(3)|acc(3)】
if is_time_stamp_zero, raw_imu(:,1) = raw_imu(:,1) - raw_imu(1,1); end      % 调整下标从零开始
if is_plot_raw_measurement, plot_imu(raw_imu,'原始IMU量测'); end            % 绘制原始数据

%% ------------------------ IMU 量测裁剪 ------------------------ %%
static.z_down = raw_imu(   0 * hz + 1:  360 * hz,:);
static.z_up   = raw_imu( 522 * hz + 1:  911 * hz,:);
static.x_up  = raw_imu( 940 * hz + 1: 1200 * hz,:);
static.x_down = raw_imu(1125 * hz + 1: 1169 * hz,:);
static.y_down = raw_imu(1488 * hz + 1: 1862 * hz,:);
static.y_up   = raw_imu(1888 * hz + 1: 2116 * hz,:);

rotation.z_n = raw_imu( 435 * hz + 1:  446 * hz,:);
rotation.z_p = raw_imu( 469 * hz + 1:  480 * hz,:);
rotation.x_p = raw_imu(1161 * hz + 1: 1171 * hz,:);
rotation.x_n = raw_imu(1194 * hz + 1: 1205 * hz,:);
rotation.y_n = raw_imu(1792 * hz + 1: 1802 * hz,:);
rotation.y_p = raw_imu(1843 * hz + 1: 1853 * hz,:);

%% ------------------------ 加速度计标定 ------------------------ %%
% 参考公式：https://www.bilibili.com/video/BV1na411Z7rQ?p=9
% 依次为 XYZ 的朝上和朝下
A = [ g,-g, 0, 0, 0, 0
      0, 0, g,-g, 0, 0
      0, 0, 0, 0, g,-g
      1, 1, 1, 1, 1, 1 ];
L = [mean(static.x_up(:,5:7))'  ,mean(static.x_down(:,5:7))',mean(static.y_up(:,5:7))',...
     mean(static.y_down(:,5:7))',mean(static.z_up(:,5:7))'  ,mean(static.z_down(:,5:7))'];
% M = (A' * A) \ A' * L 
% M = L * A' /(A * A');
AAA =  A' / (A * A'); M = L * AAA;       % 最小二乘求得 M 矩阵
Ba = M(:,4)                            % 从 M 矩阵中提取加速度计零偏向量 Ba
Ma = M(:,1:3)                          % 从 M 矩阵中提取加速度误差矩阵 Ma

%% ---------------------- 陀螺仪误差矩阵标定 -------------------- %% 


%% ------------------------ 陀螺仪零偏标定 ---------------------- %% 


